## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.example_aws.module.batch.aws_batch_compute_environment.this["fargate_spot"] will be updated in-place
!   resource "aws_batch_compute_environment" "this" {
        id                       = "example-scheduled-jobs-fargate_spot"
!       service_role             = "arn:aws:iam::376942697097:role/batch/example-scheduled-jobs-batch-20220825083603001500000002" -> (known after apply)
        tags                     = {
            "compute_environments" = "fargate_spot"
            "module"               = "batch"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.example_aws.module.batch.aws_iam_instance_profile.instance[0] must be replaced
+/- resource "aws_iam_instance_profile" "instance" {
!       arn         = "arn:aws:iam::376942697097:instance-profile/batch/example-scheduled-jobs-ecs-instance-20220825083603653300000004" -> (known after apply)
!       create_date = "2022-08-25T08:36:03Z" -> (known after apply)
!       id          = "example-scheduled-jobs-ecs-instance-20220825083603653300000004" -> (known after apply)
!       name        = "example-scheduled-jobs-ecs-instance-20220825083603653300000004" -> "example-scheduled-jobs-ecs-instance" # forces replacement
-       name_prefix = "example-scheduled-jobs-ecs-instance-" -> null # forces replacement
!       role        = "example-scheduled-jobs-ecs-instance-20220825083603000500000001" -> "example-scheduled-jobs-ecs-instance"
!       tags        = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (1 unchanged element hidden)
        }
!       tags_all    = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (3 unchanged elements hidden)
        }
!       unique_id   = "AIPAVPQ4JDKEY35Y6YZRJ" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.example_aws.module.batch.aws_iam_role.instance[0] must be replaced
+/- resource "aws_iam_role" "instance" {
!       arn                   = "arn:aws:iam::376942697097:role/batch/example-scheduled-jobs-ecs-instance-20220825083603000500000001" -> (known after apply)
!       create_date           = "2022-08-25T08:36:03Z" -> (known after apply)
!       id                    = "example-scheduled-jobs-ecs-instance-20220825083603000500000001" -> (known after apply)
!       managed_policy_arns   = [
-           "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ] -> (known after apply)
!       name                  = "example-scheduled-jobs-ecs-instance-20220825083603000500000001" -> "example-scheduled-jobs-ecs-instance" # forces replacement
!       name_prefix           = "example-scheduled-jobs-ecs-instance-" -> (known after apply)
!       tags                  = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (1 unchanged element hidden)
        }
!       tags_all              = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (3 unchanged elements hidden)
        }
!       unique_id             = "AROAVPQ4JDKE6PTQXBDCW" -> (known after apply)
        # (5 unchanged attributes hidden)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.module.batch.aws_iam_role.service[0] must be replaced
+/- resource "aws_iam_role" "service" {
!       arn                   = "arn:aws:iam::376942697097:role/batch/example-scheduled-jobs-batch-20220825083603001500000002" -> (known after apply)
!       create_date           = "2022-08-25T08:36:03Z" -> (known after apply)
!       id                    = "example-scheduled-jobs-batch-20220825083603001500000002" -> (known after apply)
!       managed_policy_arns   = [
-           "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole",
        ] -> (known after apply)
!       name                  = "example-scheduled-jobs-batch-20220825083603001500000002" -> "example-scheduled-jobs-batch" # forces replacement
!       name_prefix           = "example-scheduled-jobs-batch-" -> (known after apply)
!       tags                  = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (1 unchanged element hidden)
        }
!       tags_all              = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (3 unchanged elements hidden)
        }
!       unique_id             = "AROAVPQ4JDKEUMZ7FG3S5" -> (known after apply)
        # (5 unchanged attributes hidden)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.module.batch.aws_iam_role.spot_fleet[0] must be replaced
+/- resource "aws_iam_role" "spot_fleet" {
!       arn                   = "arn:aws:iam::376942697097:role/batch/example-scheduled-jobs-spot-20220825083603157500000003" -> (known after apply)
!       create_date           = "2022-08-25T08:36:03Z" -> (known after apply)
!       id                    = "example-scheduled-jobs-spot-20220825083603157500000003" -> (known after apply)
!       managed_policy_arns   = [
-           "arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetTaggingRole",
        ] -> (known after apply)
!       name                  = "example-scheduled-jobs-spot-20220825083603157500000003" -> "example-scheduled-jobs-spot" # forces replacement
!       name_prefix           = "example-scheduled-jobs-spot-" -> (known after apply)
!       tags                  = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (1 unchanged element hidden)
        }
!       tags_all              = {
-           "ModuleCreatedRole" = "Yes" -> null
            # (3 unchanged elements hidden)
        }
!       unique_id             = "AROAVPQ4JDKETFJW4WJFG" -> (known after apply)
        # (5 unchanged attributes hidden)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "instance" {
!       id         = "example-scheduled-jobs-ecs-instance-20220825083603000500000001-20220825083603687400000005" -> (known after apply)
!       role       = "example-scheduled-jobs-ecs-instance-20220825083603000500000001" -> "example-scheduled-jobs-ecs-instance" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.example_aws.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "service" {
!       id         = "example-scheduled-jobs-batch-20220825083603001500000002-20220825083603722500000006" -> (known after apply)
!       role       = "example-scheduled-jobs-batch-20220825083603001500000002" -> "example-scheduled-jobs-batch" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.example_aws.module.batch.aws_iam_role_policy_attachment.spot_fleet["arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetTaggingRole"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "spot_fleet" {
!       id         = "example-scheduled-jobs-spot-20220825083603157500000003-20220825083603769800000007" -> (known after apply)
!       role       = "example-scheduled-jobs-spot-20220825083603157500000003" -> "example-scheduled-jobs-spot" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.example_aws.module.execution_role.data.aws_iam_policy_document.assume_role_with_mfa[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_mfa" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "true",
                ]
+               variable = "aws:MultiFactorAuthPresent"
            }
+           condition {
+               test     = "NumericLessThan"
+               values   = [
+                   "86400",
                ]
+               variable = "aws:MultiFactorAuthAge"
            }

+           principals {
+               identifiers = [
+                   "ecs-tasks.amazonaws.com",
                ]
+               type        = "Service"
            }
+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # module.example_aws.module.execution_role.aws_iam_role.this[0] will be updated in-place
!   resource "aws_iam_role" "this" {
!       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Condition = {
-                           Bool            = {
-                               "aws:MultiFactorAuthPresent" = "true"
                            }
-                           NumericLessThan = {
-                               "aws:MultiFactorAuthAge" = "86400"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           AWS     = []
-                           Service = "ecs-tasks.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "example-scheduled-jobs-ecs-task-exec"
        name                  = "example-scheduled-jobs-ecs-task-exec"
        tags                  = {
            "module" = "execution_role"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 7 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

